#include <stdio.h>

int main()
{
    // 한글 음절 영역(0xAC00 ~ 0xDCAF) = (초성 인덱스 * 21 + 중성 인덱스) * 28 + 종성 인덱스 + 0xAC00
    int N; // 한글 문자 순서
    char input[3]; // 한글 음절
    char *onset[19] = {"ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"}; // 초성
    char *nucleus[21] = {"ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅘ", "ㅙ", "ㅚ", "ㅛ", "ㅜ", "ㅝ", "ㅞ", "ㅟ", "ㅠ", "ㅡ", "ㅢ", "ㅣ"}; // 중성
    char *coda[28] = {"\n", "ㄱ", "ㄲ", "ㄳ", "ㄴ", "ㄵ", "ㄶ", "ㄷ", "ㄹ", "ㄺ", "ㄻ", "ㄼ", "ㄽ", "ㄾ", "ㄿ", "ㅀ", "ㅁ", "ㅂ", "ㅄ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ"}; // 종성

    scanf("%c%c%c", &input[0], &input[1], &input[2]);
    N = 4096 * (input[0] + 22) + 64 * (input[1] + 80) + (input[2] + 128);

    printf("%s", onset[N / (21 * 28)]);
    printf("\n%s", nucleus[(N % (21 * 28)) / 28]);
    printf("\n%s", coda[(N % (21 * 28)) % 28]);

	return 0;
}